---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.AnalyticalModelSelector
source: html/08f72b75-87c5-163a-4225-252842cfcf13.htm
---
# AnalyticalModelSelector Properties

The portion of the curve to be selected.